{
    "version": "https://jsonfeed.org/version/1",
    "title": "Chau Hung Cheung, cyrus",
    "subtitle": "人之為學，不可自小，又不可自大",
    "icon": "http://example.com/assets/favicon.ico",
    "description": "LIFE || GYM || CS",
    "home_page_url": "http://example.com",
    "items": [
        {
            "id": "http://example.com/2024/11/11/diary/Diary-11-11-2024/",
            "url": "http://example.com/2024/11/11/diary/Diary-11-11-2024/",
            "title": "Diary-11/11/2024",
            "date_published": "2024-11-11T08:04:53.000Z",
            "content_html": "<h1 id=\"date-2024-11-11\"><a class=\"anchor\" href=\"#date-2024-11-11\">#</a> Date: 2024-11-11</h1>\n<h2 id=\"first-diary\"><a class=\"anchor\" href=\"#first-diary\">#</a> First Diary</h2>\n<h3 id=\"introduction\"><a class=\"anchor\" href=\"#introduction\">#</a> Introduction</h3>\n<p>Since I feel like no one will see this website, I want to share something from the bottom of my heart. (If you see this diary, hope you have a nice day!) Maybe in the future when I look back, I will laugh at my words lol.</p>\n<h3 id=\"how-i-am-right-now\"><a class=\"anchor\" href=\"#how-i-am-right-now\">#</a> How I am Right Now</h3>\n<p>I have improved some aspects of myself but found some weaknesses that I need to face right now.</p>\n<h4 id=\"two-main-physical-improvements\"><a class=\"anchor\" href=\"#two-main-physical-improvements\">#</a> Two Main Physical Improvements:</h4>\n<ol>\n<li>\n<p><strong>Better Skin Quality</strong></p>\n<ul>\n<li>In the past, I had tons of acne on my face. It made me feel terrible. I was extremely insecure about it. I felt afraid and sad when I looked in the mirror. No cap lol. I tried different retinoic acid (A 酸) products but they didn't work. However, deep down, I knew I could deal with this problem soon. I kept researching and developed better habits, such as drinking more water and changing the pillow cover (枕頭套) every 3 days. The main change was discovering different kinds of retinoic acid. I used to use benzoyl peroxide (which didn’t work well and made my face burn), then I switched to Tretinoin cream. It worked really well. After that, my skin started getting better day by day :&gt;</li>\n</ul>\n</li>\n<li>\n<p><strong>Cutting My Weight</strong></p>\n<ul>\n<li>When I was 82kgs, I didn’t know I was fat. I know it sounds dumb, lol. However, I didn’t realize it until I asked my little brother, &quot;Hey, am I actually fat?&quot; He said, &quot;Yeah!&quot; It was a shock for me, and he took a photo of me. That moment made me feel like I messed up my life. So, I started losing weight. I'm still losing weight but I need to control the speed of weight loss because losing weight too quickly can result in losing muscle. Let's see the result later on. Maybe I'll post the result of my first cut at the end of December on Instagram. :&gt;</li>\n</ul>\n</li>\n</ol>\n<h4 id=\"the-issue-i-need-to-face\"><a class=\"anchor\" href=\"#the-issue-i-need-to-face\">#</a> The Issue I Need to Face:</h4>\n<ol>\n<li><strong>Bad at Communicating with Others</strong>\n<ul>\n<li>I feel comfortable when I'm alone but it feels like it's the only choice for me. I'm still thinking about how to solve this issue. Every time I see someone having a good time with their friends, I feel sad. This feeling is weird. I'm not jealous, but I know I’m weak in that part. The good thing is that in my daily life, I meet lots of nice people 😛 and deep down, I know I will solve this problem :&gt;</li>\n</ul>\n</li>\n</ol>\n<h3 id=\"conclusion\"><a class=\"anchor\" href=\"#conclusion\">#</a> Conclusion</h3>\n<p>I like the quote, &quot;You become what you think.&quot; Hope you all who read this far have a nice day :p</p>\n<p><img loading=\"lazy\" data-src=\"https://upload.wikimedia.org/wikipedia/en/3/33/Patrick_Star.svg\" alt=\"Patrick\" /></p>\n",
            "tags": [
                "Diary"
            ]
        },
        {
            "id": "http://example.com/2024/11/09/gym/Creatine/",
            "url": "http://example.com/2024/11/09/gym/Creatine/",
            "title": "Creatine",
            "date_published": "2024-11-09T09:22:35.000Z",
            "content_html": "<h1 id=\"the-complete-guide-to-creatine-benefits-usage-and-safety\"><a class=\"anchor\" href=\"#the-complete-guide-to-creatine-benefits-usage-and-safety\">#</a> The Complete Guide to Creatine: Benefits, Usage, and Safety</h1>\n<p><strong>Date:</strong> November 9, 2024</p>\n<h2 id=\"introduction\"><a class=\"anchor\" href=\"#introduction\">#</a> Introduction</h2>\n<p>Supp guys! I find out that creatine is a great supplement to have while working hard in gym. Thats why I want to write this blog about it. Creatine is one of the most popular and well-researched supplements in the fitness world. Whether you're an athlete, bodybuilder, or just looking to improve your workout performance, creatine can offer numerous benefits. In this blog, we'll explore what creatine is, how it works, its benefits, proper usage, and safety considerations.</p>\n<h2 id=\"what-is-creatine\"><a class=\"anchor\" href=\"#what-is-creatine\">#</a> What is Creatine?</h2>\n<p>Creatine is a naturally occurring compound found in small amounts in certain foods and synthesized by the body. It is primarily stored in muscle cells, where it helps produce energy during high-intensity activities.</p>\n<h3 id=\"how-does-creatine-work\"><a class=\"anchor\" href=\"#how-does-creatine-work\">#</a> How Does Creatine Work?</h3>\n<p>Creatine enhances the production of adenosine triphosphate (ATP), the primary energy carrier in cells. During intense exercise, ATP is rapidly depleted. Creatine phosphate donates a phosphate group to ADP, regenerating ATP and allowing for sustained energy production.</p>\n<h2 id=\"benefits-of-creatine\"><a class=\"anchor\" href=\"#benefits-of-creatine\">#</a> Benefits of Creatine</h2>\n<p>Creatine offers a wide range of benefits for both athletes and non-athletes:</p>\n<ol>\n<li>\n<p><strong>Increased Muscle Mass</strong>:</p>\n<ul>\n<li>Studies have shown that creatine supplementation can lead to an increase in muscle mass by up to 8% over periods ranging from 5 to 12 weeks.</li>\n<li>For example, a study published in the Journal of Strength and Conditioning Research found that participants who supplemented with creatine gained an average of 2.2 kg (4.85 lbs) of muscle mass over 12 weeks.</li>\n</ul>\n</li>\n<li>\n<p><strong>Enhanced Strength and Power</strong>:</p>\n<ul>\n<li>Research indicates that creatine can improve maximum power/strength by 5-15%.</li>\n<li>In a study by the International Society of Sports Nutrition, athletes experienced a 20% increase in strength in high-intensity activities such as weightlifting.</li>\n</ul>\n</li>\n<li>\n<p><strong>Improved Exercise Performance</strong>:</p>\n<ul>\n<li>Creatine has been shown to increase exercise performance by 10-20% in various sports and physical activities.</li>\n<li>For example, sprint performance improved by 8% and the number of overall work repetitions increased by 14% in a study published in the Journal of Applied Physiology.</li>\n</ul>\n</li>\n<li>\n<p><strong>Faster Recovery</strong>:</p>\n<ul>\n<li>Creatine supplementation has been found to reduce muscle cell damage and inflammation, leading to faster recovery times. Athletes reported a 30% decrease in muscle soreness and improved muscle recovery after intense workouts.</li>\n</ul>\n</li>\n<li>\n<p><strong>Cognitive Benefits</strong>:</p>\n<ul>\n<li>Emerging research suggests that creatine might have cognitive benefits. A study published in the journal Psychopharmacology found that participants who took creatine experienced a 20% improvement in memory and intelligence test scores.</li>\n</ul>\n</li>\n</ol>\n<h2 id=\"how-to-use-creatine\"><a class=\"anchor\" href=\"#how-to-use-creatine\">#</a> How to Use Creatine</h2>\n<h3 id=\"dosage-and-timing\"><a class=\"anchor\" href=\"#dosage-and-timing\">#</a> Dosage and Timing</h3>\n<ol>\n<li><strong>Loading Phase</strong>: Some people choose to start with a loading phase, which involves taking 20 grams of creatine per day (split into 4 doses) for 5-7 days. This saturates the muscles with creatine quickly.</li>\n<li><strong>Maintenance Phase</strong>: After loading, a maintenance dose of 3-5 grams per day is sufficient to maintain elevated creatine levels.</li>\n<li><strong>Timing</strong>: Creatine can be taken at any time of the day, but it's often recommended to take it post-workout when your muscles are more receptive to nutrient uptake.</li>\n</ol>\n<h3 id=\"types-of-creatine\"><a class=\"anchor\" href=\"#types-of-creatine\">#</a> Types of Creatine</h3>\n<ul>\n<li><strong>Creatine Monohydrate</strong>: The most studied and effective form of creatine.</li>\n<li><strong>Micronized Creatine</strong>: Creatine monohydrate that has been processed into smaller particles for better solubility.</li>\n<li><strong>Creatine HCl</strong>: A form of creatine bonded with hydrochloric acid for improved absorption.</li>\n</ul>\n<h2 id=\"safety-and-side-effects\"><a class=\"anchor\" href=\"#safety-and-side-effects\">#</a> Safety and Side Effects</h2>\n<p>Creatine is generally considered safe for most people when taken at recommended doses. However, some users may experience minor side effects, including:</p>\n<ul>\n<li><strong>Water Retention</strong>: Creatine can cause muscles to retain water, which may lead to temporary weight gain.</li>\n<li><strong>Digestive Issues</strong>: Some people experience stomach discomfort or bloating.</li>\n<li><strong>Muscle Cramping</strong>: Although rare, some users report muscle cramping.</li>\n</ul>\n<h3 id=\"who-should-avoid-creatine\"><a class=\"anchor\" href=\"#who-should-avoid-creatine\">#</a> Who Should Avoid Creatine?</h3>\n<ul>\n<li>Individuals with kidney issues or impaired renal function should avoid creatine or consult a healthcare professional before use.</li>\n<li>Pregnant or breastfeeding women should also avoid creatine supplementation.</li>\n</ul>\n<h2 id=\"conclusion\"><a class=\"anchor\" href=\"#conclusion\">#</a> Conclusion</h2>\n<p>Creatine is a powerful supplement that can enhance muscle growth, strength, and overall exercise performance. By understanding how to properly use creatine and being aware of potential side effects, you can safely incorporate it into your fitness routine to achieve your goals.</p>\n<hr />\n<p>Feel free to reach out if you have any questions or need further information. Happy lifting!</p>\n<p><img loading=\"lazy\" data-src=\"https://ih1.redbubble.net/image.5557560933.1515/st,small,507x507-pad,600x600,f8f8f8.u1.jpg\" alt=\"Patrick\" /></p>\n",
            "tags": [
                "Gym"
            ]
        },
        {
            "id": "http://example.com/2024/01/07/diary/Introduction-cyrus/",
            "url": "http://example.com/2024/01/07/diary/Introduction-cyrus/",
            "title": "Introduction-cyrus",
            "date_published": "2024-01-06T16:00:00.000Z",
            "content_html": "<h1 id=\"welcome-to-my-blog\"><a class=\"anchor\" href=\"#welcome-to-my-blog\">#</a> Welcome to My Blog!</h1>\n<p><a href=\"https://chauhungcheungcyrus999.github.io/\">My website</a>! This is my very first post. Can't believe it, right? 😛 Same here. I've recently learned to use Hexo, and it's really nice stuff to learn, not gonna lie (ngl). I love this theme because it makes me feel relaxed :&gt;</p>\n<h2 id=\"features-of-this-website\"><a class=\"anchor\" href=\"#features-of-this-website\">#</a> Features of This Website</h2>\n<ol>\n<li><strong>Playlist:</strong> We have a music playlist featuring songs from JAY. I love his music very much.</li>\n<li><strong>Sidebar</strong></li>\n<li><strong>Favicon &amp; Failure Icon</strong></li>\n<li><strong>Menu Page</strong></li>\n<li>...</li>\n</ol>\n<h2 id=\"future-plans\"><a class=\"anchor\" href=\"#future-plans\">#</a> Future Plans</h2>\n<p>I will be adding different functions to the website, such as a comment section and a character that will follow the pointer. I probably will get a domain name for it, and I always want to automate updates on GitHub because no one wants to manually move updates every time.</p>\n<h2 id=\"action-speaks-louder-than-words\"><a class=\"anchor\" href=\"#action-speaks-louder-than-words\">#</a> Action Speaks Louder Than Words</h2>\n<p>Let's see my updates.</p>\n",
            "tags": [
                "Diary"
            ]
        }
    ]
}